# Reason Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationVersionInfo..::..Reason Property
FabricationVersionInfo Class See Also
---
The user-specified reason for the change.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string Reason { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Reason As String
	Get
```

Visual C++
---
```text
public:
property String^ Reason {
	String^ get ();
}
```

# See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace